tests/jmeter/auth-load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Aura API Auth Load Test" enabled="true">
      <stringProp name="TestPlan.comments">
        Load test for POST /api/auth/token.
        20 concurrent users, each requests 5 tokens = 100 total requests.
        Run from JMeter container: jmeter -n -t /tests/auth-load.jmx -l /tests/results.jtl -e -o /tests/report
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">${__P(BASE_HOST,workspace)}</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">${__P(BASE_PORT,5000)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <hashTree>

        <!-- ── Thread Group: 20 users, ramp 2s, 5 iterations each ── -->
        <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                     testname="Auth Users" enabled="true">
          <intProp name="ThreadGroup.num_threads">20</intProp>
          <intProp name="ThreadGroup.ramp_time">2</intProp>
          <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
          <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
          <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
            <boolProp name="LoopController.continue_forever">false</boolProp>
            <intProp name="LoopController.loops">5</intProp>
          </elementProp>
          <hashTree>

            <!-- ── HTTP Request: POST /api/auth/token ── -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                              testname="POST /api/auth/token" enabled="true">
              <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
              <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
              <stringProp name="HTTPSampler.protocol">http</stringProp>
              <stringProp name="HTTPSampler.path">/api/auth/token</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="body" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{"tenantId":"TenantA","clientType":"ui","userName":"jmeter-user${__threadNum}"}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <hashTree>

                <!-- Content-Type header -->
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                               testname="HTTP Headers" enabled="true">
                  <collectionProp name="HeaderManager.headers">
                    <elementProp name="Content-Type" elementType="Header">
                      <stringProp name="Header.name">Content-Type</stringProp>
                      <stringProp name="Header.value">application/json</stringProp>
                    </elementProp>
                  </collectionProp>
                </HeaderManager>

                <!-- Assert HTTP 200 -->
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                   testname="Assert HTTP 200" enabled="true">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="49587">200</stringProp>
                  </collectionProp>
                  <intProp name="Assertion.test_type">2</intProp>
                  <stringProp name="Assertion.custom_message">Expected HTTP 200</stringProp>
                </ResponseAssertion>

                <!-- Assert response contains accessToken -->
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                                   testname="Assert accessToken in body" enabled="true">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="49587">accessToken</stringProp>
                  </collectionProp>
                  <intProp name="Assertion.test_type">2</intProp>
                  <stringProp name="Assertion.custom_message">Response must contain accessToken</stringProp>
                </ResponseAssertion>

              </hashTree>
            </HTTPSamplerProxy>

          </hashTree>
        </ThreadGroup>

        <!-- ── Listeners (CLI mode: results written to file) ── -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/tests/results.jtl</stringProp>
        </ResultCollector>

      </hashTree>
    </TestPlan>
  </hashTree>
</jmeterTestPlan>